// src/lib/questions.ts

export const categoriesRound1 = [
  {
    name: "Классика литературы",
    questions: [
      { text: "Автор 'Войны и мира'.", answer: "Лев Толстой", points: 100 },
      { text: "В каком произведении появляется герой Родион Раскольников?", answer: "'Преступление и наказание'", points: 200 },
      { text: "Какой поэт написал 'Я помню чудное мгновенье...'?", answer: "Александр Пушкин", points: 300 },
      { text: "Как называется роман Михаила Булгакова о дьяволе в Москве?", answer: "'Мастер и Маргарита'", points: 400 },
      { text: "Назовите автора 'Обломова'.", answer: "Иван Гончаров", points: 500 },
    ],
  },
  {
    name: "Кино и театр",
    questions: [
      { text: "В каком фильме впервые прозвучала фраза: «Умом Россию не понять»?", answer: "«Дни Турбиных» (1976, по пьесе Булгакова)", points: 100 },
      { text: "Какой советский фильм был удостоен премии 'Оскар' за лучший фильм на иностранном языке?", answer: "'Москва слезам не верит'", points: 200 },
      { text: "Как зовут главного героя фильма 'Ирония судьбы, или С лёгким паром!'?", answer: "Женя Лукашин", points: 300 },
      { text: "Какая актриса исполнила главную роль в фильме 'Зеркало' Андрея Тарковского?", answer: "Маргарита Терехова", points: 400 },
      { text: "В какой стране происходит завязка сюжета фильма «Бриллиантовая рука»?", answer: "Турция", points: 500 },
    ],
  },
  {
    name: "Наука вокруг нас",
    questions: [
      { text: "Самый распространённый газ в атмосфере Земли (около 78%).", answer: "Азот", points: 100 },
      { text: "Единица измерения электрического тока, названная в честь французского физика.", answer: "Ампер", points: 200 },
      { text: "Какой элемент обозначается символом Fe и составляет около 5% массы земной коры?", answer: "Железо", points: 300 },
      { text: "Кто сформулировал закон всемирного тяготения после наблюдения за падающим яблоком?", answer: "Исаак Ньютон", points: 400 },
      { text: "Как называется самая большая планета Солнечной системы, масса которой в 2,5 раза больше массы всех остальных планет вместе взятых?", answer: "Юпитер", points: 500 },
    ],
  },
  {
    name: "География и путешествия",
    questions: [
      { text: "Какой европейский город называют 'городом мостов', и в нем их более 400?", answer: "Венеция", points: 100 },
      { text: "В какой стране находится самый высокий водопад в мире — Анхель?", answer: "Венесуэла", points: 200 },
      { text: "Какое озеро является самым глубоким в мире?", answer: "Байкал", points: 300 },
      { text: "Какой остров является самым большим по площади на планете?", answer: "Гренландия", points: 400 },
      { text: "Какой город считается самым северным миллионником мира?", answer: "Санкт-Петербург", points: 500 },
    ],
  },
  {
    name: "Советское прошлое",
    questions: [
      { text: "Как назывался первый искусственный спутник Земли?", answer: "Спутник-1", points: 100 },
      { text: "В каком году состоялся первый полёт человека в космос?", answer: "1961", points: 200 },
      { text: "Как называлась первая в мире атомная электростанция, запущенная в СССР?", answer: "Обнинская АЭС", points: 300 },
      { text: "Как называлась популярная советская игра с волком и яйцами?", answer: "'Ну, погоди!' (электронная игра 'Ну, погоди!')", points: 400 },
      { text: "Как называлась первая советская цветная телепередача?", answer: "'Голубой огонёк'", points: 500 },
    ],
  },
];

export const categoriesRound2 = [
  {
    name: "Музыкальная пауза",
    questions: [
      { text: "Кто написал музыку к балету 'Лебединое озеро'?", answer: "Пётр Чайковский", points: 100 },
      { text: "Кто был солистом группы 'Кино'?", answer: "Виктор Цой", points: 200 },
      { text: "Какой музыкальный инструмент считается национальным символом Шотландии?", answer: "Волынка", points: 300 },
      { text: "Как называется знаменитая песня из советского фильма «Ирония судьбы, или С лёгким паром!», которую исполнила Алла Пугачёва?", answer: "«Миллион алых роз»", points: 400 },
      { text: "Какой русский народный музыкальный инструмент состоит из деревянного корпуса с натянутыми струнами и часто использовался в народных песнях и танцах?", answer: "Балалайка", points: 500 },
    ],
  },
  {
    name: "Необычные факты о мире",
    questions: [
      { text: "Какое животное может спать до 22 часов в сутки?", answer: "Коала", points: 100 },
      { text: "Какой напиток считается самым популярным в мире?", answer: "Чай (за исключением воды)", points: 200 },
      { text: "Какое единственное млекопитающее способно летать?", answer: "Летучая мышь", points: 300 },
      { text: "Какой фрукт содержит больше сахара: лимон или клубника?", answer: "Лимон", points: 400 },
      { text: "В какой стране официально нет рек?", answer: "Саудовская Аравия", points: 500 },
    ],
  },
  {
    name: "Знаменитые путешествия и открытия",
    questions: [
      { text: "Кто первым совершил кругосветное путешествие, доказав, что Земля круглая?", answer: "Фернан Магеллан", points: 100 },
      { text: "Какой мореплаватель открыл Америку в 1492 году?", answer: "Христофор Колумб", points: 200 },
      { text: "Какой исследователь первым достиг Южного полюса в 1911 году?", answer: "Руаль Амундсен", points: 300 },
      { text: "Какое открытие сделал Александр Флеминг в 1928 году, оказавшее огромное влияние на медицину?", answer: "Пенициллин", points: 400 },
      { text: "Какой путешественник первым пересёк Сахару на верблюде?", answer: "Ливингстон (Дэвид Ливингстон)", points: 500 },
    ],
  },
  {
    name: "Рекорды и необычные достижения",
    questions: [
      { text: "Какая башня считается самой высокой в мире на 2024 год?", answer: "Бурдж-Халифа", points: 100 },
      { text: "Какое животное является самым быстрым на суше?", answer: "Гепард", points: 200 },
      { text: "Какой океан самый глубокий на планете?", answer: "Тихий океан", points: 300 },
      { text: "Какой человек первым совершил полёт в космос?", answer: "Юрий Гагарин", points: 400 },
      { text: "Какой остров — самый большой по площади в мире?", answer: "Гренландия", points: 500 },
    ],
  },
  {
    name: "Современная молодёжь",
    questions: [
      { text: "Какая социальная сеть в 2025 году считается самой популярной среди российских подростков и молодёжи?", answer: "Telegram", points: 100 },
      { text: "В какой соцсети молодёжь чаще всего смотрит и создаёт короткие вирусные видео?", answer: "TikTok", points: 200 },
      { text: "Как называется популярный формат юмора и творчества в интернете, который часто используют молодые люди для самовыражения?", answer: "Мемы", points: 300 },
      { text: "Какой музыкальный жанр остаётся одним из самых популярных среди современной молодёжи?", answer: "Рэп", points: 400 },
      { text: "Как называется стиль одежды, в котором вещи нарочно выглядят очень большими и свободными, создавая ощущение объёма и комфорта?", answer: "Оверсайз", points: 500 },
    ],
  },
];

export const finalQuestion = {
  text: "Если бы вы могли задать один вопрос любому философу прошлого или настоящего, какой бы это был вопрос и почему?",
  answer: "Это зависит от личных интересов.",
};
